deprecated_cases/half_width_block/fluid-openfoam/0/ExplicitMomentum
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      ExplicitMomentum;
}

dimensions      [1 0 0 0 0 0 0];   // N
internalField   uniform (0 0 0);
boundaryField
{
    ".*"
    {
        type            zeroGradient;
    }
}
