deprecated_cases/half_width_block/fluid-openfoam/0/ImplicitMomentum
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ImplicitMomentum;
}

dimensions      [0 0 -1 0 0 0 0];   // 1/s
internalField   uniform 0;
boundaryField
{
    ".*"
    {
        type            zeroGradient;
    }
}
