deprecated_cases/half_width_block/fluid-openfoam/system/fvOptions
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}

options
{
    momentumSource
    {
        type            vectorSemiImplicitSource;
        active          yes;
        
        vectorSemiImplicitSourceCoeffs
        {
            selectionMode   all;
            volumeMode      absolute;
            sources
            {
                U
                {
                    explicit
                    {
                        type        exprField;
                        expression  "ExplicitMomentum";
                    }

                    implicit
                    {
                        type        exprField;
                        expression  "-ImplicitMomentum";
                        // expression  "-ImplicitMomentum * 1e6";
                    }
                }
            }
        }
    }
}
